---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient2Slab
source: html/50e99b93-a989-faff-412b-68e4294d933e.htm
---
# Autodesk.Revit.DB.ParameterTypeId.PathReinHookOrient2Slab Property

"Alternating Bar - Hook Orientation"

## Syntax (C#)
```csharp
public static ForgeTypeId PathReinHookOrient2Slab { get; }
```